app/controllers/movies_controller.rb

  def index
    @movies = Movie.order "#{params[:sort]} #{params[:direction]}"
---
SELECT "movies".* FROM "movies" ORDER BY release_date desc