app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.pluck(:rating).uniq.sort
    @checked_ratings = @all_ratings if @checked_ratings.nil?

    session[:sort] = params[:sort] if !params[:sort].nil? && session[:sort] != params[:sort]
    session[:direction] = params[:direction] if !params[:direction].nil? && session[:direction] != params[:direction]
    session[:ratings] = params[:ratings] if !params[:ratings].nil? && session[:ratings] != params[:ratings]

    redirect_to movies_path(sort: session[:sort], direction: session[:direction], ratings: session[:ratings]) if
        params[:sort].nil? && params[:ratings].nil? && params[:direction].nil? && params[:direction].nil? &&
            (!session[:sort].nil? || !session[:ratings].nil?)

    @sort = session[:sort]
    @direction = session[:direction]
    @ratings = session[:ratings]

    session[:ratings].nil? ? ratings = Movie.pluck(:rating).uniq.sort : ratings = @ratings.keys
    @checked_ratings = ratings

    (@sort.nil?) ?
      @movies = Movie.where(rating: ratings) :
---
SELECT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date asc